Revit 2027 API
ElectricalSetting.CircuitSequence Property
 The sequence in which power circuits are created.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircuitSequence CircuitSequence { get; set; }
Public Property CircuitSequence As CircuitSequence
	Get
	Set
public:
property CircuitSequence CircuitSequence {
	CircuitSequence get ();
	void set (CircuitSequence value);
}
member CircuitSequence : CircuitSequence with get, set
Property Value
CircuitSequence
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace